<!-- terraform-plan-comment -->
### Terraform Plan

#### Initialization  `success`
#### Plan  `success`

<details><summary>Show Plan</summary>

```terraform
random_id.suffix: Refreshing state... [id=SDmmTw]
data.archive_file.page_generator_zip: Reading...
data.archive_file.lambda_zip: Reading...
data.archive_file.lambda_zip: Read complete after 0s [id=5ecf306f8a9aa6ef4a1605e393d1e35b83fc2b99]
data.archive_file.page_generator_zip: Read complete after 0s [id=25d2360d8e846156f2f17e7a0556b4c280d0b899]
data.aws_cloudfront_cache_policy.caching_optimized: Reading...
data.aws_cloudfront_response_headers_policy.security: Reading...
aws_cloudfront_origin_access_control.site: Refreshing state... [id=E362GSXPUAZ3M6]
aws_s3_bucket.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_iam_role.page_generator_exec: Refreshing state... [id=bruce-quotes-page-generator-exec]
aws_route53_zone.main: Refreshing state... [id=Z02196392OCM77HDMQZC7]
aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-east-2:628639830692:certificate/fcd00a28-eb73-45bf-b11f-8e658d04566a]
aws_iam_role.lambda_exec: Refreshing state... [id=bruce-quotes-lambda-exec]
aws_dynamodb_table.quotes: Refreshing state... [id=bruce-quotes]
data.aws_cloudfront_origin_request_policy.cors_s3_origin: Reading...
data.aws_cloudfront_response_headers_policy.security: Read complete after 1s [id=67f7725c-6f97-4210-82d7-5512b31e9d03]
aws_s3_bucket.www_redirect: Refreshing state... [id=www-shitbrucesays.co.uk]
data.aws_cloudfront_cache_policy.caching_optimized: Read complete after 1s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
aws_apigatewayv2_api.http_api: Refreshing state... [id=ijed2skzy9]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::628639830692:oidc-provider/token.actions.githubusercontent.com]
aws_iam_role_policy_attachment.page_generator_basic: Refreshing state... [id=bruce-quotes-page-generator-exec/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_acm_certificate.cf: Refreshing state... [id=arn:aws:acm:us-east-1:628639830692:certificate/50c4b402-2aa2-4e14-8950-392f25254474]
data.aws_cloudfront_origin_request_policy.cors_s3_origin: Read complete after 0s [id=88a5eaf4-2fd4-4709-b370-b4c650ea3fcf]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=bruce-quotes-lambda-exec/arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
aws_iam_role.github_terraform_apply: Refreshing state... [id=bruce-quotes-github-terraform-apply]
aws_iam_role.github_terraform_plan: Refreshing state... [id=bruce-quotes-github-terraform-plan]
aws_iam_policy.ddb_access: Refreshing state... [id=arn:aws:iam::628639830692:policy/bruce-quotes-ddb-access]
aws_lambda_function.api: Refreshing state... [id=bruce-quotes-api]
aws_route53_record.api_validation["api.shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__bebc934a45fa942b0df090b700ce79c4.api.shitbrucesays.co.uk._CNAME]
aws_apigatewayv2_stage.default: Refreshing state... [id=$default]
aws_route53_record.cf_validation["shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__d627e24d7f5c6061d4a1173b065ef389.shitbrucesays.co.uk._CNAME]
aws_route53_record.cf_validation["www.shitbrucesays.co.uk"]: Refreshing state... [id=Z02196392OCM77HDMQZC7__7e712fa0335addbfc9c83b37781bae5a.www.shitbrucesays.co.uk._CNAME]
aws_iam_role_policy_attachment.ddb_to_lambda: Refreshing state... [id=bruce-quotes-lambda-exec/arn:aws:iam::628639830692:policy/bruce-quotes-ddb-access]
aws_s3_object.css: Refreshing state... [id=bruce-quotes-site-4839a64f/styles.css]
aws_s3_object.robots: Refreshing state... [id=bruce-quotes-site-4839a64f/robots.txt]
aws_lambda_function.page_generator: Refreshing state... [id=bruce-quotes-page-generator]
aws_s3_bucket_public_access_block.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_iam_policy.page_generator_access: Refreshing state... [id=arn:aws:iam::628639830692:policy/bruce-quotes-page-generator-access]
aws_s3_object.favicon: Refreshing state... [id=bruce-quotes-site-4839a64f/favicon.svg]
aws_s3_bucket_ownership_controls.site: Refreshing state... [id=bruce-quotes-site-4839a64f]
aws_s3_object.js: Refreshing state... [id=bruce-quotes-site-4839a64f/app.js]
aws_iam_role_policy.github_terraform_apply: Refreshing state... [id=bruce-quotes-github-terraform-apply:terraform-apply-permissions]
aws_acm_certificate_validation.api: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_iam_role_policy.github_terraform_plan: Refreshing state... [id=bruce-quotes-github-terraform-plan:terraform-plan-permissions]
aws_s3_bucket_public_access_block.www_redirect: Refreshing state... [id=www-shitbrucesays.co.uk]
aws_s3_bucket_website_configuration.www_redirect: Refreshing state... [id=www-shitbrucesays.co.uk]
aws_iam_role_policy_attachment.page_generator_access: Refreshing state... [id=bruce-quotes-page-generator-exec/arn:aws:iam::628639830692:policy/bruce-quotes-page-generator-access]
aws_lambda_permission.api_invoke: Refreshing state... [id=AllowExecutionFromAPIGateway]
aws_apigatewayv2_integration.lambda_integration: Refreshing state... [id=01j05f6]
aws_route53_record.www_a: Refreshing state... [id=Z02196392OCM77HDMQZC7_www.shitbrucesays.co.uk_A]
aws_apigatewayv2_domain_name.api: Refreshing state... [id=api.shitbrucesays.co.uk]
aws_acm_certificate_validation.cf: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
aws_lambda_event_source_mapping.dynamodb_stream: Refreshing state... [id=2c115c0d-9b51-4a45-8fd2-6603a51c9ea2]
aws_apigatewayv2_route.post_quotes: Refreshing state... [id=elwndgu]
aws_apigatewayv2_route.get_quotes: Refreshing state... [id=urzvk7b]
aws_apigatewayv2_route.options_quotes: Refreshing state... [id=ywezhrh]
aws_apigatewayv2_api_mapping.api: Refreshing state... [id=uwchwi]
aws_route53_record.api: Refreshing state... [id=Z02196392OCM77HDMQZC7_api_A]
aws_cloudfront_distribution.site: Refreshing state... [id=E2T928B9V6ESU6]
aws_s3_object.index: Refreshing state... [id=bruce-quotes-site-4839a64f/index.html]
aws_route53_record.apex_a: Refreshing state... [id=Z02196392OCM77HDMQZC7_shitbrucesays.co.uk_A]
aws_route53_record.apex_aaaa: Refreshing state... [id=Z02196392OCM77HDMQZC7_shitbrucesays.co.uk_AAAA]
data.aws_iam_policy_document.site_allow_cf: Reading...
data.aws_iam_policy_document.site_allow_cf: Read complete after 0s [id=1183247607]
aws_s3_bucket_policy.site_cf: Refreshing state... [id=bruce-quotes-site-4839a64f]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.github_terraform_apply will be updated in-place
  ~ resource "aws_iam_role" "github_terraform_apply" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike   = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:thekbb/shitbrucesays:ref:refs/heads/main" -> "repo:thekbb/shit-bruce-says:ref:refs/heads/main"
                            }
                            # (1 unchanged attribute hidden)
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "bruce-quotes-github-terraform-apply"
        name                  = "bruce-quotes-github-terraform-apply"
        tags                  = {
            "Name" = "github-terraform-apply"
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.api will be updated in-place
  ~ resource "aws_lambda_function" "api" {
        id                             = "bruce-quotes-api"
      ~ last_modified                  = "2025-12-18T19:30:00.000+0000" -> (known after apply)
      ~ source_code_hash               = "pf75co4WiJJtXWAPdMDzOv64ezLB+4l5E0+GQy4oU/8=" -> "XEAJPoYVAgWkyLu1O4RZCGasieqUrS9TJsk1zGRrSHE="
        tags                           = {}
        # (29 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_s3_bucket_lifecycle_configuration.site will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "site" {
      + bucket                                 = "bruce-quotes-site-4839a64f"
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "us-east-2"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-noncurrent-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
    }

  # aws_s3_bucket_versioning.site will be created
  + resource "aws_s3_bucket_versioning" "site" {
      + bucket = "bruce-quotes-site-4839a64f"
      + id     = (known after apply)
      + region = "us-east-2"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 2 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @thekbb, Action: `pull_request`*